html/tool/c#.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>c#学习</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="c#学习"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-31T16:13+0800"/>
<meta name="author" content="ZHAO Xin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/default.css"/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">c#学习</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">想实现类似office 2007界面效果(Ribbon?)</a></li>
<li><a href="#sec-2">程序要求</a></li>
<li><a href="#sec-3">笔记</a>
<ul>
<li><a href="#sec-3-1">混合模式程序集是针对“v2.0.50727”版的运行时生成的</a></li>
<li><a href="#sec-3-2">如何使用 zedgraph</a></li>
<li><a href="#sec-3-3">由数据库到 zedgraph list</a></li>
<li><a href="#sec-3-4">皮肤控制</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">想实现类似office 2007界面效果(Ribbon?)</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>依托容器控件, 例子迅雷界面. 用split, panel, tablelayout组合
</li>
<li>用qt, wpf<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>, gtk+等界面框架
</li>
<li>用 DotNetBar 或 DevExpress 收费控件
</li>
<li>用 irisskin2 皮肤风格
</li>
</ul>


<p>
最终选择 DotNetBar.
</p><div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> WPF主要为了随意控件windows控件的位置，显示比较炫的界面。你如果想做UI 设计师。 可以深入WPF专做这个。 什么渐变, 谈化, 透明什么的。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">程序要求</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>菜单右侧显示 炮号, 测试时间
</li>
<li>tree 为测试项目, 不同项目显示多个可选曲线, 右侧为总线曲线中当前点数值
</li>
<li>背景黑色, 点状 grid, 40ms 总长 30s 共 750 个点. 放大最大 1 ms 1 个点.
</li>
<li>趋势测试, 3个曲线连接.
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">笔记</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">混合模式程序集是针对“v2.0.50727”版的运行时生成的</h3>
<div class="outline-text-3" id="text-3-1">

<p>添加新项，应用程序配置。实际就是在程序源码目录下添加了app.config文件。
在app.config中的configuration节内添加子节Startup，详细如下：
</p><pre class="example">
&lt;startup useLegacyV2RuntimeActivationPolicy="true"&gt;
    &lt;supportedRuntime version="v4.0" sku = ".NETFramework,Version=v4.0"/&gt;
    &lt;supportedRuntime version="v2.0.50727"/&gt;
&lt;/startup&gt;
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">如何使用 zedgraph</h3>
<div class="outline-text-3" id="text-3-2">

<p>参考 cs sample
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">由数据库到 zedgraph list</h3>
<div class="outline-text-3" id="text-3-3">

<p>dataset, datatable, datarow, convert.Double
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">皮肤控制</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>dotNetBarManager 属性可设置 color scheme，但找到颜色配置文件, dcs后缀。
</li>
<li>ribbon 风格控件可在属性里直接改。
</li>
<li>form 继承 Office2007RibbonForm, 在 form<sub>load</sub> 函数里用下列语句:
</li>
</ul>

<pre class="example">
RibbonPredefinedColorSchemes.ChangeOffice2007ColorTable(this, DevComponents.DotNetBar.Rendering.eOffice2007ColorScheme.Black);
</pre>



<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> DEFINITION NOT FOUND: 1
</p>

</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-31T16:13+0800</p>
<p class="author">Author: ZHAO Xin</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
